app/views/comments/_comment.html.erb


<li><strong><%= comment.user.email.split('@').first %>:</strong> <%= comment.content %></li>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]