app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "updated_at", "user_id", "page") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["content", "nice "], ["created_at", "2023-11-29 20:00:12.830691"], ["updated_at", "2023-11-29 20:00:12.830691"], ["user_id", 2], ["page", "trey"]]
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save